export const movies = [
  {
    id: 0,
    title: '抓馬戀人',
    rating: 8.3,
    genre: '劇情',
    releaseDate: '2024-04-03',
    image: 'https://upload.wikimedia.org/wikipedia/zh/5/54/The_Drama_%28film%29_poster.jpg',
    dates: ['06/01 (一)', '06/02 (二)', '06/03 (三)', '06/04 (四)', '06/05 (五)'],
    times: ['12:00', '17:20', '20:00'],
    storyline: '故事始於麻薩諸塞州劍橋市的一家咖啡館。查理（Charlie）向正在閱讀的艾瑪（Emma）搭訕，謊稱自己讀過同一本書。艾瑪看似對查理置之不理，查理悻悻返回座位，隨後再次上前為自己唐突的行為致歉。艾瑪此時才注意到他並解釋稱，自己有一側耳朵失聰，因此剛才並未聽到他說話。她邀請查理將最初的搭訕重新演示一遍，兩人隨後開始交往。',
    cast: ['羅伯·派汀森', '辛蒂亞'],
    duration: '1 小時 46 分鐘',
    ratingClassification: '輔12級',
    // 日期+時間當作key
    soldSeats: {
      '06/01 (一)-12:00': ['A1', 'A2', 'B3'],
      '06/02 (一)-17:20': ['C1', 'D5'],
      '06/03 (二)-20:00': ['A1', 'B2', 'C3', 'D4'],
    }
  },
  {
    id: 1,
    title: '麥可傑克森',
    rating: 7.9,
    genre: '傳記',
    releaseDate: '2024-04-22',
    image: 'https://upload.wikimedia.org/wikipedia/zh/f/fa/Michael_%282026_film%29_Poster.jpg',
    dates: ['06/01 (一)', '06/02 (二)', '06/03 (三)', '06/04 (四)', '06/05 (五)'],
    times: ['10:30', '15:20', '18:00'],
    storyline: '劇情深刻刻畫了麥可從童年跟隨「傑克森五人組」出道、歷經父親嚴格且極端的訓練，到單飛後成為全球巨星的傳奇人生與心路歷程。',
    cast: ['賈法·傑克森', '柯爾曼·多明戈'],
    duration: '2 小時 7 分鐘',
    ratingClassification: '輔12級',
    // 日期+時間當作key
    soldSeats: {
      '06/01 (一)-10:30': ['C4', 'C6', 'F10'],
      '06/04 (四)-15:20': ['F7', 'F8'],
      '06/05 (五)-18:00': ['E6', 'E7', 'E10', 'E11'],
    }
  },
  {
    id: 2,
    title: '穿著Prada的惡魔2',
    rating: 7.1,
    genre: '劇情',
    releaseDate: '2024-04-29',
    image: 'https://upload.wikimedia.org/wikipedia/zh/b/b2/The_Devil_Wears_Prada_2_poster.jpg',
    dates: ['06/01 (一)', '06/02 (二)', '06/03 (三)', '06/04 (四)', '06/05 (五)'],
    times: ['12:00', '17:20', '20:00'],
    storyline: '安德莉亞·「安迪」·薩克斯（Andrea "Andy" Sachs）離開《伸展台》雜誌助理職位二十年後，已成為《先鋒報》紐約分社的資深記者。她在出席一場新聞獎頒獎典禮且即將上台領獎時，與同僚同時收到了報社發布的集體裁員簡訊。隨後，安迪上台領取獎項，並於發表得獎感言時，向大眾公開了《先鋒報》員工遭無預警解僱的消息。',
    cast: ['梅莉·史翠普', '安·海瑟薇', '艾蜜莉·布朗', '史丹利·圖奇'],
    duration: '1 小時 59 分鐘',
    ratingClassification: '普遍級',
    // 日期+時間當作key
    soldSeats: {
      '06/01 (一)-12:00': ['A1', 'A2', 'B3'],
      '06/02 (一)-17:20': ['C1', 'D5'],
      '06/03 (二)-20:00': ['A1', 'B2', 'C3', 'D4'],
    }
  },
  {
    id: 3,
    title: '魅影巨星',
    rating: 6.6,
    genre: '驚悚',
    releaseDate: '2024-04-17',
    image: 'https://upload.wikimedia.org/wikipedia/zh/6/6f/Mother_Mary_2026_poster.jpg',
    dates: ['06/01 (一)', '06/02 (二)', '06/03 (三)', '06/04 (四)', '06/05 (五)'],
    times: ['10:30', '15:20', '18:00'],
    storyline: '傳奇流行天后「聖母瑪莉」（安海瑟薇 飾）在經歷嚴重的情緒潰堤後突然中止了巡演。當她準備舉辦復出演唱會以重返巔峰時，找上了疏遠多年的御用服裝設計師兼昔日摯友（麥凱拉柯爾 飾）。在為新巡演打造完美舞台形象的過程中，兩人深埋已久的傷痛與心結被逐漸揭開，引發一連串充滿暗黑、神祕與魔幻色彩的心理交鋒。',
    cast: ['安·海瑟薇', '麥凱拉·柯爾'],
    duration: '1 小時 50 分鐘',
    ratingClassification: '輔12級',
    // 日期+時間當作key
    soldSeats: {
      '06/01 (一)-10:30': ['C4', 'C6', 'F10'],
      '06/04 (四)-15:20': ['F7', 'F8'],
      '06/05 (五)-18:00': ['E6', 'E7', 'E10', 'E11'],
    }
  },
  {
    id: 4,
    title: '真人快打2',
    rating: 7.2,
    genre: '動作',
    releaseDate: '2024-05-07',
    image: 'https://upload.wikimedia.org/wikipedia/zh/e/e9/Mortal_Kombat_2_2025_Poster.jpg',
    dates: ['06/01 (一)', '06/02 (二)', '06/03 (三)', '06/04 (四)', '06/05 (五)'],
    times: ['12:00', '17:20', '20:00'],
    storyline: '紹康皇帝在真人快打大賽中殺害了國王傑洛德，以魔界之名吞併了伊甸界，並強娶王后辛黛爾為妻，將琪塔娜公主收為養女。多年後，第十屆真人快打大賽即將舉行。拳痴奉紹康之命復活了空佬與加納，但加納因本身性格極度腐敗而無法被其控制。在地球界，雷電大人與刀鋒索尼婭找到了落魄演員強尼·凱吉，希望他能與索尼婭、劉康、賈克斯·布里格斯及科爾·楊一同擔任第五位守護者，但強尼拒絕參賽。賽事正式展開。第一輪比賽中，索尼婭對上遭到魔化的辛黛爾，強尼則被強行傳送去對抗琪塔娜。',
    cast: ['卡爾·艾本', '艾德琳·羅道夫', '潔西卡·麥克納米', '喬許·羅森'],
    duration: '1 小時 56 分鐘',
    ratingClassification: '保護級',
    // 日期+時間當作key
    soldSeats: {
      '06/01 (一)-12:00': ['A1', 'A2', 'B3'],
      '06/02 (一)-17:20': ['C1', 'D5'],
      '06/03 (二)-20:00': ['A1', 'B2', 'C3', 'D4'],
    }
  },
  {
    id: 5,
    title: '屍速禁區',
    rating: 8.2,
    genre: '動作',
    releaseDate: '2024-05-22',
    image: 'https://upload.wikimedia.org/wikipedia/zh/c/c3/Colony_2026_film_poster.jpg',
    dates: ['06/01 (一)', '06/02 (二)', '06/03 (三)', '06/04 (四)', '06/05 (五)'],
    times: ['10:30', '15:20', '18:00'],
    storyline: '講述因不明病毒導致一棟建築被封鎖，感染者以不可預測的方式不斷進化後，對生還者構成威脅的故事',
    cast: ['全智賢', '具教煥', '池昌旭', '申鉉彬'],
    duration: '2 小時 3 分鐘',
    ratingClassification: '輔12級',
    // 日期+時間當作key
    soldSeats: {
      '06/01 (一)-10:30': ['C4', 'C6', 'F10'],
      '06/04 (四)-15:20': ['F7', 'F8'],
      '06/05 (五)-18:00': ['E6', 'E7', 'E10', 'E11'],
    }
  },
  {
    id: 6,
    title: '曼達洛人與古古',
    rating: 7.7,
    genre: '冒險',
    releaseDate: '2024-05-20',
    image: 'https://upload.wikimedia.org/wikipedia/zh/4/4c/The_Mandalorian_and_Grogu_poster.jpg',
    dates: ['06/01 (一)', '06/02 (二)', '06/03 (三)', '06/04 (四)', '06/05 (五)'],
    times: ['12:00', '17:20', '20:00'],
    storyline: '劇情講述孤膽賞金獵人「丁·賈林」（曼達洛人）在收留並保護年幼的「古古」（同屬尤達大師種族）後，兩人成為銀河系中最強大且受歡迎的父子搭檔，一同四處冒險並對抗帝國殘黨。',
    cast: ['佩德羅·帕斯卡', '傑瑞米·艾倫·懷特'],
    duration: '2 小時 12 分鐘',
    ratingClassification: '保護級',
    // 日期+時間當作key
    soldSeats: {
      '06/01 (一)-12:00': ['A1', 'A2', 'B3'],
      '06/02 (一)-17:20': ['C1', 'D5'],
      '06/03 (二)-20:00': ['A1', 'B2', 'C3', 'D4'],
    }
  },
  {
    id: 7,
    title: '後室',
    rating: 8.0,
    genre: '驚悚',
    releaseDate: '2024-05-27',
    image: 'https://upload.wikimedia.org/wikipedia/zh/3/3d/Backrooms_%28film%29_poster.jpg',
    dates: ['06/01 (一)', '06/02 (二)', '06/03 (三)', '06/04 (四)', '06/05 (五)'],
    times: ['10:30', '15:20', '18:00'],
    storyline: '1990年，Async Corporation的科學家觀看Async研究員納倫·沃恩（Naren Warne）所拍攝的影像紀錄。當時納倫正在探索一處被稱為「後室」的大型超維度空間。納倫在尋找出口時，遭到「生命體」追逐，最終被黑色的人形生物殺害。',
    cast: ['奇維托·艾吉佛', '蕾娜特·萊茵斯薇'],
    duration: '1 小時 45 分鐘',
    ratingClassification: '輔15級',
    // 日期+時間當作key
    soldSeats: {
      '06/01 (一)-10:30': ['C4', 'C6', 'F10'],
      '06/04 (四)-15:20': ['F7', 'F8'],
      '06/05 (五)-18:00': ['E6', 'E7', 'E10', 'E11'],
    }
  },
];